OpenFOAM/foam9tutorials/interfluo/OpenFOAM-pulsingJet_cases/2d_jet_fine/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          8;
        startFace       237352;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1200;
        startFace       237360;
    }
    outlet
    {
        type            patch;
        nFaces          248;
        startFace       238560;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          238080;
        startFace       238808;
    }
)

// ************************************************************************* //
