OpenFOAM/foam9tutorials/interfluo/OpenFOAM-pulsingJet_cases/2d_jet_fine/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Tinlet          298;

dimensions      [0 0 0 1 0 0 0];

internalField   uniform $Tinlet;

boundaryField
{
    inlet
    {
        type            inletOutlet;
        inletValue      uniform $Tinlet;
        value           $inletValue;
    }
	
	outlet
    {
        type            zeroGradient; 
    }

	walls
    {
        type            zeroGradient;
    }

	frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
